distributed_algorithms/elections.org
#+SETUPFILE: theme.setup
#+TITLE: Elections in Anonymous Networks
* Elections in anonymous networks
  - anonymous networks are networks in which processes *do not* have unique id's
    - storing id's too expensive
    - processes do not wish to reveal ids'
    - absence of unique hardware ids

  - If one is a leader, how can each process be provided with a unique id
    - wave algorithm, pass around token each process increments token value by 1
      and uses it as id

** Pitfalls of elections
   - Anonymous network elections not always terminating

** Fairness
   - if an event E can occur it is never ignored infinitely many times

** Probabilistic algorithms
   - in a probabilistic algorithm a process may performed an even based on a
     random choice

*** Las Vegas and Monte Carlo
    - An Alg is *Las Vegas* if
      - the probability that it terminates is greater than 0
      - all terminal configs are correct
    - An Alg is *Monte Carlo* if
      - it always terminates
      - the probability that a terminal config is correct is > 0

* Itai-Rodeh election algorithm
  - adaptation of Chang-Roberts
  - All processes know the right size N
  - Each initiator selects a *random id* from ${1, ..., N}$
  - Processes may select the same id
    - each message is tagged with hop count
    - message arriving at source has hop count N
    - if multiple processes select same largest id they start a new round

** How it works
   - all initiators active in *round 0*
   - let p be /active/ at the start of *election round* n
   - p randomly selects id_{p}
     - sends (n, id_{p}, 1 false) and waits for message (n', i, h b)
     - 3rd value is the hop count
     - 4th value signals if another process q with the same id was encountered
   - P only becomes leader if it receives its id after N hops with dirty bit
     set to false

*** Message Complexity
    - O(NlogN)

* Echo Algorithm
  - All processes know the network size N
  - initiators active in *round 0*
  - Each proc selects random id and starts a wave
    - tagged with *id* and *round counter*
  - let proc p in wave i of round n be hit by wave j or round n'
    - if n' > n or n' = n and j>i
      - p adopts wave of j according to echo algorithm
    - if n' < n or n' = n and j <i
      - p discards wave of j according to echo algorithm
  - Each message sent upwards in constructed tree reports size of sub-tree
  - All other messages report 0
  - When proc p decided it computes the size of constructed tree.
  - if computed size is not equal to N. wave did not complete

** Pitfalls
   if a wave completes before covering whole network and advances to next round,
   message from possible leader form previous round will be discarded

   - Don't need to be largest id in the network to progress to next round

** Computing the size of the network
   - there is no Las Vegas algorithm to compute size of an anonymous ring
   - Hence it is impossible to have a Las Vegas election algorithm if processes
     do not know network size
* Itai-Rodeh ring size algorithm
  - Each process p maintains an estimate (*est_{p}*) of the ring size
  - initially est_{p} = 2
  - p initiates an estimate round at:
    - start on an alg run
    - at each update of est_{p}
  - Each round, p selects random id_{p} in ${1, .., R}$ sends *(est_{p}, id_{p}, 1)*
    - hc = hopcount
    - p waits for a message *(est, id, hc)*
      - always hc < est
  - Every note *will* have the same estimate at the end of algorithm run

** How it works
   - est < est_p P dismisses the message
   - est > est_p
     - if h < est p sends (est, id, h +1) and est_p <- est
     - if h = est then est_p <- est + 1
   - est = est_p
     - if h < est, then p sends (est, id, h+1)
     - if h = est and id != id_p then est_p <- est + 1
     - if h = est and id = id_p then p dismisses the message (possibly its own message returned)

** Pitfalls
   - since it is a Monte Carlo algorithm it can result in est < N at the end of
     run

** Complexity
   - The prob of computing an incorrect size thends to 0 as R tends to infinity
* Leader Election in unknown *acyclic* network
  - A tree algorithm is used
  - Networks containing a *cycle* result in a time-out
    - Tree algorithm results in deadlock in cyclic networks
** How it works
   - When a process has one possible parent it sends a *parent request* to its neighbour
     - if request accepted an *ack* is sent back
   - Last 2 parentless processes can send parent requests to each other.
     - *Root contention*
   - Each process in root contention randomly decides to
     - (a) /wait some time/ for a parent request from the other process
     - (b) /immediately/ send a parent request again
   - node which waited becomes the leader of network

** Interesting note
   - During root contention it is better to give higher probability to sending
     again rather than to waiting
     - *Highly dependant on the network condition*
